Revit 2017 API
BRepBuilder Class
 A class that allows direct construction of geometry objects (solids, open shells, etc.).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class BRepBuilder : ShapeBuilder
Visual Basic
Public Class BRepBuilder _
	Inherits ShapeBuilder
Visual C++
public ref class BRepBuilder : public ShapeBuilder
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ShapeBuilder
 Autodesk.Revit.DB.BRepBuilder
See Also
BRepBuilder Members
Autodesk.Revit.DB Namespace